12/data/attachments/f9f77bfd4162588a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Catherine_all_Friend_40207_9</nif:username>
            <nif:friendToBeRequested>soap_friends_969af944-d2f4-4ef0-a2bb-438e86edbf98</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>